title: Pskeylogger
id: 37b0e357-4976-4810-868a-2d22dde26ea9
status: test
description: Detects 
references:
    - https://detection.fyi/sigmahq/sigma/windows/powershell/powershell_script/posh_ps_keylogging/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.001/src/Get-Keystrokes.ps1
author: Hyun Woo Kim
date: 2024/05/28
tags:
    - attack.t1056.001
    - attack.collection
logsource:
    category: process_creation
    product: windows
detection:
    selection_basic:
        CommandLine|contains: 'Get-Keystrokes'
    selection_high: # want to run in background and keyboard
        CommandLine|contains:
            - 'Get-ProcAddress user32.dll GetAsyncKeyState'
            - 'Get-ProcAddress user32.dll GetForegroundWindow'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: critical
