//AUTHOR: Hyun Woo Kim, DeepSeas, Threat Detection Engineer
//SUBJECT: This query detects remote services installed on browser extension that can be used for initial access or persistence
//False Positives: Low
//Confidence Level: High
//Note: Edge browser will be also counted later on
let vpnExtension = datatable(ExtensionID:string, ExtensionName:string,ExtensionIDEdge:string)
[
    //Google Chrome ExtensionID and ExtensionName and Edge
    "fdcgdnkidjaadafnichfpabhfomcebme", "ZenMate VPN", "kepdippgcikacmcdaijnponnfgljfbea",
    "fcfhplploccackoneaefokcmbjfbkenj", "1clickVPN", "pmogomcckhjhjndmcgjchnfoalglganm",
    "bihmplhobchoageeokmgbdihknkjbknd", "Touch VPN", "ighhnpmaabelnfcbbkijikgghajbiaml",
    "gkojfkhlekighikafcpjkiklfbnlmeio", "Hola Free VPN", "eibinhpjpbkmjeohlclnebmkhdfehpbf",
    "jajilbjjinjmgcibalaakngmkilboobh", "Astar VPN", "phnnpafoelnadmgjkinijkbaogoekoff",
    "gjknjjomckknofjidppipffbpoekiipm", "VPN Free", "panammoooggmlehahpcjckcncfeffcoi",
    "nabbmpekekjknlbkgpodfndbodhijjem", "Earth VPN","",
    "kpiecbcckbofpmkkkdibbllpinceiihk", "DotVPN", "",
    "nlbejmccbhkncgokjcmghpfloaajcffj", "Hotspot Shield Free VPN", "cdbkakmeogejmlpgioplhjkaablahbmj",
    "omghfjlpggmjjaagoclmmobgdodcjboh", "Browsec VPN", "fjnehcbecaggobjholekjijaaekbnlgj",
    "bibjcjfmgapbfoljiojpipaooddpkpai", "VPN-free.pro", "cfkbkhdknmompejddpoicenjnalclpjg",
    "mpcaainmfjjigeicjnlkdfajbioopjko", "VPN Unlimited Free", "afbegdjlledbjnldkkealalienoigmcp",
    "jljopmgdobloagejpohpldgkiellmfnc", "PP VPN","",
    "lochiccbgeohimldjooaakjllnafhaid", "IP Unblock","",
    "nhnfcgpcbfclhfafjlooihdfghaeinfc", "Surf VPN", "hkfdicocnlbecanimmgjnbbehnjjggob",
    "ookhnhpkphagefgdiemllfajmkdkcaim", "iNinja VPN","",
    "namfblliamklmeodpcelkokjbffgmeoo", "Daily VPN","",
    "nbcojefnccbanplpoffopkoepjmhgdgh", "Hoxx VPN Proxy", "mmkgibaofkehmmnbcfleonelhenlgcbc",
    "majdfhpaihoncoakbjgbdhglocklcgno", "Free VPN", "panammoooggmlehahpcjckcncfeffcoi",
    "lnfdmdhmfbimhhpaeocncdlhiodoblbd", "VPN PROXY MASTER", "khjiehkgjhenojhmmmlaacmhfdggbeng",
    "eppiocemhmnlbhjplcgkofciiegomcon", "Urban Free VPN", "nimlmejbmnecnaghgmbahmbaddhjbecg",
    "cocfojppfigjeefejbpfmedgjbpchcng", "SaferVPN Proxy", "",
    "foiopecknacmiihiocgdjgbjokkpkohc", "VPN Professional", "kekfppnajjchccpkfaogiomfcncbgagc",
    "hhdobjgopfphlmjbmnpglhfcgppchgje", "AdGuard VPN", "bkcoaehlnhbggcbmohegigjfgfdiihmp",
    "jgbaghohigdbgbolncodkdlpenhcmcge", "Free VPN", "panammoooggmlehahpcjckcncfeffcoi",
    "inligpkjkhbpifecbdjhmdpcfhnlelja", "Free One Touch VPN","",
    "higioemojdadgdbhbbbkfbebbdlfjbip", "Unlimited VPN & Proxy by ibVPN","",
    "hipncndjamdcmphkgngojegjblibadbe", "RusVPN","",
    "iolonopooapdagdemdoaihahlfkncfgg", "Azino VPN","",
    "nhfjkakglbnnpkpldhjmpmmfefifedcj", "Pron VPN","",
    "jpgljfpmoofbmlieejglhonfofmahini", "Free Residential VPN", "okbhiennphaebjppchigomdehdblhoee",
    "fgddmllnllkalaagkghckoinaemmogpe", "ExpressVPN","",
    "ejkaocphofnobjdedneohbbiilggdlbi", "Hotspot Shield Elite VPN Proxy", "cdbkakmeogejmlpgioplhjkaablahbmj",
    "keodbianoliadkoelloecbhllnpiocoi", "Hide My IP VPN","",
    "hoapmlpnmpaehilehggglehfdlnoegck", "Tunnello VPN","",
    "poeojclicodamonabcabmapamjkkmnnk", "HMA VPN Proxy Unblocker","",
    "dfkdflfgjdajbhocmfjolpjbebdkcjog", "Free Avira Phantom VPN","",
    "kcdahmgmaagjhocpipbodaokikjkampi", "Hola VPN", "eibinhpjpbkmjeohlclnebmkhdfehpbf",
    "klnkiajpmpkkkgpgbogmcgfjhdoljacg", "Free VPN for Chrome","",
    "lneaocagcijjdpkcabeanfpdbmapcjjg", "Hub VPN","",
    "pgfpignfckbloagkfnamnolkeaecfgfh", "Free Proxy VPN","",
    "jplnlifepflhkbkgonidnobkakhmpnmh", "Private Internet Access","",
    "jliodmnojccaloajphkingdnpljdhdok", "Turbo VPN for PC", "fealcnalljoifmplplknbajoapbfcbed",
    "hnmpcagpplmpfojmgmnngilcnanddlhb", "Windscribe", "dkkdbpgldnmkhcliffjpajcfdjkcaddf",
    "ffbkglfijbcbgblgflchnbphjdllaogb", "CyberGhost VPN","",
    "kcndmbbelllkmioekdagahekgimemejo", "VPN.AC","",
    "jdgilggpfmjpbodmhndmhojklgfdlhob", "Browser VPN","",
    "bihhflimonbpcfagfadcnbbdngpopnjb", "DEEPRISM VPN","",
    "ppajinakbfocjfnijggfndbdmjggcmde", "My Browser Vpn", "jlealjkojkacidgfdbndefahgikbmgon",
    "oofgbpoabipfcfjapgnbbjjaenockbdp", "SetupVPN", "okhjkpgblgdjappgfgakbcecdblgffcl",
    "bhnhkdgoefpmekcgnccpnhjfdgicfebm", "Wachee VPN", "",
    "knmmpciebaoojcpjjoeonlcjacjopcpf", "Thunder Proxy", "ihfnpedpgpdihdimpmjlhgfifkcbjkdf",
    "dhadilbmmjiooceioladdphemaliiobo", "Free Proxy VPN","",
    "jedieiamjmoflcknjdjhpieklepfglin", "FastestVPN Proxy", "bmocdgcdjlkpiagjcicnfacjebeeofca",
    "mhngpdlhojliikfknhfaglpnddniijfh", "WorkingVPN", "fodhjdclionkbgbpjhoibehdjioihcnd",
    "omdakjcmkglenbhjadbccaookpfjihpa", "TunnelBear VPN", "ogemdakneofkpppkcfkgmbiopdpioipj",
    "npgimkapccfidfkfoklhpkgmhgfejhbj", "BelkaVPN", "jgcpnjohjdaokjinmckdaeicklkpibde",
    "akeehkgglkmpapdnanoochpfmeghfdln", "VPN Master", "khjiehkgjhenojhmmmlaacmhfdggbeng",
    "gbmdmipapolaohpinhblmcnpmmlgfgje", "Unblock Websites","",
    "aigmfoeogfnljhnofglledbhhfegannp", "Lethean Proxy VPN","",
    "cgojmfochfikphincbhokimmmjenhhgk", "Whoer VPN", "nbikhpkcemncdkkhhmlcnhjcbioegafk",
    "ficajfeojakddincjafebjmfiefcmanc", "Best VPN USA","",
    "ifnaibldjfdmaipaddffmgcmekjhiloa", "FREE VPN DEWELOPMENT","",
    "jbnmpdkcfkochpanomnkhnafobppmccn", "apkfold free vpn","",
    "apcfdffemoinopelidncddjbhkiblecc", "Soul VPN","",
    "mjolnodfokkkaichkcjipfgblbfgojpa", "DotVPN","",
    "oifjbnnafapeiknapihcmpeodaeblbkn", "rderzh VPN Proxy","",
    "plpmggfglncceinmilojdkiijhmajkjh", "Red Panda VPN", "ocfndfckhpnfnfeehekkgfofolhoghfn",
    "mjnbclmflcpookeapghfhapeffmpodij", "Ultrareach VPN","",
    "bblcccknbdbplgmdjnnikffefhdlobhp", "FastStunnel VPN", "cjgaebdenpbinnemblipkjmlphidnind",
    "aojlhgbkmkahabcmcpifbolnoichfeep", "VirtualShield VPN","",
    "lcmammnjlbmlbcaniggmlejfjpjagiia", "Adblock Office VPN Proxy Server","",
    "knajdeaocbpmfghhmijicidfcmdgbdpm", "Guru VPN & Proxy","",
    "bdlcnpceagnkjnjlbbbcepohejbheilk", "Malus VPN", "mklimbcpglbjohihbpdmnfhlkciacbhm",
    "edknjdjielmpdlnllkdmaghlbpnmjmgb", "Muscle VPN","",
    "eidnihaadmmancegllknfbliaijfmkgo", "Push VPN","",
    "ckiahbcmlmkpfiijecbpflfahoimklke", "Gom VPN","",
    "macdlemfnignjhclfcfichcdhiomgjjb", "Free Fast VPN","",
    "chioafkonnhbpajpengbalkececleldf", "BullVPN","",
    "amnoibeflfphhplmckdbiajkjaoomgnj", "HideAll VPN","",
    "llbhddikeonkpbhpncnhialfbpnilcnc", "ProxyFlow","",
    "pcienlhnoficegnepejpfiklggkioccm", "Cloud VPN","",
    "iocnglnmfkgfedpcemdflhkchokkfeii", "sVPN","",
    "igahhbkcppaollcjeaaoapkijbnphfhb", "Social VPN","",
    "njpmifchgidinihmijhcfpbdmglecdlb", "Trellonet Trellonet","",
    "ggackgngljinccllcmbgnpgpllcjepgc", "WindmillVPN","",
    "kchocjcihdgkoplngjemhpplmmloanja", "IPBurger Proxy & VPN","",
    "bnijmipndnicefcdbhgcjoognndbgkep", "Veee","",
    "lklekjodgannjcccdlbicoamibgbdnmi", "Anonymous Proxy Vpn Browser","",
    "dbdbnchagbkhknegmhgikkleoogjcfge", "Hideman VPN","",
    "egblhcjfjmbjajhjhpmnlekffgaemgfh", "Fornex VPN","",
    "ehbhfpfdkmhcpaehaooegfdflljcnfec", "WeVPN", "nkealpajpedbohiholfdhbjppdgfhjkb",
    "bkkgdjpomdnfemhhkalfkogckjdkcjkg", "VPNMatic","",
    "almalgbpmcfpdaopimbdchdliminoign", "Urban Shield", "jckkfbfmofganecnnpfndfjifnimpcel",
    "akkbkhnikoeojlhiiomohpdnkhbkhieh", "Prime VPN","",
    "gbfgfbopcfokdpkdigfmoeaajfmpkbnh", "westwind","",
    "bniikohfmajhdcffljgfeiklcbgffppl", "Upnet","",
    "lejgfmmlngaigdmmikblappdafcmkndb", "uVPN", "ffcobagjhencnhemanghdmgokpodejja",
    "ffhhkmlgedgcliajaedapkdfigdobcif", "Nucleus VPN","",
    "gcknhkkoolaabfmlnjonogaaifnjlfnp", "FoxyProxy Standard", "flcnoalcefgkhkinjkffipfdhglnpnem",
    "pooljnboifbodgifngpppfklhifechoe", "GeoProxy","",
    "fjoaledfpmneenckfbpdfhkmimnjocfa", "NordVPN", "fphgeikpdcdcheaochkhldmnfblfogla",
    "aakchaleigkohafkfjfjbblobjifikek", "ProxFlow","",
    "dpplabbmogkhghncfbfdeeokoefdjegm", "Proxy SwitchySharp","",
    "padekgcemlokbadohgkifijomclgjgif", "Proxy SwitchyOmega", "fdbloeknjpnloaggplaobopplkdhnikc",
    "bfidboloedlamgdmenmlbipfnccokknp", "PureVPN", "pmekdamgipmmgecfoogolgafcdfigoec",
];
let chrome = DeviceFileEvents
| where FolderPath contains "\\Google\\Chrome\\User Data\\Webstore Downloads\\"
| extend ExtensionIDOnly = split(FileName,"_")[0] // only grabs the extensionID and separate ex.) _13241.crx
| extend ExtensionIDOnly_string = tostring(ExtensionIDOnly) // should grab edge and Chrome and confirmed
| join kind=inner (vpnExtension) on $left.ExtensionIDOnly_string == $right.ExtensionID;
let edge = DeviceFileEvents
| where FolderPath contains "\\Edge\\User Data\\Webstore Downloads\\"
| extend ExtensionIDOnly = split(FileName,"_")[0] // only grabs the extensionID and separate ex.) _13241.crx
| extend ExtensionIDOnly_string = tostring(ExtensionIDOnly) // should grab edge and Chrome and confirmed
| join kind=inner (vpnExtension) on $left.ExtensionIDOnly_string == $right.ExtensionIDEdge;
union edge,chrome
| extend Note = strcat("External Remote services ", ExtensionName," detected. Monitor the user/endpoint permission and check network connections for initial access or network persistence")
| project Timestamp, DeviceId, DeviceName, InitiatingProcessFileName, ExtensionName, ExtensionID, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessAccountSid, InitiatingProcessAccountUpn, InitiatingProcessFolderPath, InitiatingProcessId, ReportId, Note//DeviceFileEvents
